
#Область Тесты
Процедура Тест1()
	
	ФорматОтвета = Перечисления.ФорматыОтветаФункцииПроверки.СтрокаJSONБезСпецСимволов;
	
	Объект.Результаты.Очистить();
	
	Валидатор = Обработки.Валидатор.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тесты.Схема КАК Схема,
		|	Тесты.Данные КАК Данные,
		|	Тесты.ОжидаемыйРезультат КАК ОжидаемыйРезультат,
		|	Тесты.Наименование КАК Наименование,
		|	Тесты.Описание КАК Описание,
		|	Тесты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Тесты КАК Тесты
		|ГДЕ
		|	НЕ Тесты.ЭтоГруппа
		|	И НЕ Тесты.НеЗапускать";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПолученныйРезультат	= ВалидацияЗначенийКлиентСервер.ПроверитьСоответствиеСхеме(Выборка.Схема, Выборка.Данные, ФорматОтвета);	
		ОжидаемыйРезультат	= СтроковыеФункцииКлиентСервер.СтрокаБезСпецСимволов(Выборка.ОжидаемыйРезультат);
					
		НоваяСтрока = Объект.Результаты.Добавить();
		НоваяСтрока.Тест =  Выборка.Ссылка;
		НоваяСтрока.Схема = Выборка.Схема;
		НоваяСтрока.Данные = Выборка.Данные;
		НоваяСтрока.ОжидаемыйРезультат = ОжидаемыйРезультат;
		НоваяСтрока.ПолученныйРезультат = ПолученныйРезультат;
		НоваяСтрока.Успех = (ОжидаемыйРезультат = ПолученныйРезультат); 		
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти



&НаСервере
Процедура ЗапускТестовНаСервере()
	
	Тест1();	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускТестов(Команда)
	ЗапускТестовНаСервере();
КонецПроцедуры
