
&НаСервере
Процедура ВключитьГруппуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тесты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Тесты КАК Тесты
		|ГДЕ
		|	НЕ Тесты.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочникОбъект.НеЗапускать = НЕ СправочникОбъект.НеЗапускать;
		//СправочникОбъект.НеЗапускать = Ложь;
		СправочникОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьГруппу(Команда)
	ВключитьГруппуНаСервере();
КонецПроцедуры
